{
    "name": "Acquiring Hardware",
    "icon": "minecraft:crafting_table",
    "category": "getting_through_the_stone_age",
    "pages": [
        {
            "type": "text",
            "text": "You cannot chop down a tree without an axe. Well, you can, but you will not get any logs by punching a tree. In order to harvest wood, you're going to need a flint hatchet. You can find flint the usual way, by digging gravel, but you can also get flint when digging dirt or sand. I recommend sand if gravel isn't available, as digging dirt has some inherent danger until you have a shovel.$(br2)The flint hatchet requires you to flake the flint. This is done by punching the gravel against a hard block, like stone. Just punch once, then wait a half-second before trying again. You'll hear a distinct sound when it is done correctly. It may not succeed the first time, so if you fail, just try again. Sometimes, you do destroy the flint with nothing to show for it.$(br2)Once you have the flaked flint, you'll need plant twine. You can get this from grass, either digging up grassy dirt blocks or by cutting the grass on top. You'll get lots and lots of this stuff; fortunately, it can be used as fuel. More on that later. For the moment, just craft the plant fiber into twine; three fiber gives one twine.$(br2)The last thing you need are sticks. You can't chop down a tree yet, so you cannot get sticks the traditional way. Instead, you'll have to break a tree's leaves. They'll frequently give you sticks. Once you acquire a stick, the chipped flint, twine, and stick can be combined to make a hatchet. Now you'll be able to chop down those trees.$(br2)Once you have wood, you'll be able to make yourself a crafting table. A slightly cheaper crafting table is made using the hatchet on the log in a crafting grid. Due to a reduced return on planks when crafting without a saw, the normal crafting table will require two logs. Once you have a crafting table, you can make tools such as the flint saw, which gives you 3 planks, as well as a flint axe, work blade, and other such flint tools. One thing to note about flint tools: they can be repaired in the crafting grid; no anvil required! Furthermore, when you do repair them in your crafting grid, they'll retain any enchantments that have been placed on them."
        }
    ]
}
